SizzleUnrlsd/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/bma400/bma400.cpp
    uint8_t buffer[BMA400_MAX_LEN];
    buffer[0] = reg_addr;
    memcpy(&buffer[1], reg_data, length);

    NrfI2C::write(device.m_bus, device.m_addr, (uint8_t*)buffer, length + sizeof(reg_addr), false);

    DEBUG_TRACE("BMA400LL::i2c_write %x : %x",reg_addr, reg_data);

    return BMA400_OK;
}

int8_t BMA400LL::i2c_read(uint8_t reg_addr, uint8_t *reg_data, uint32_t length, void *intf_ptr)
{
    DEBUG_TRACE("BMA400LL::i2c_read -> intf_ptr=%p, *(uint8_t *)intf_ptr=%x", intf_ptr, *(uint8_t *)intf_ptr);

    BMA400LL& device = BMA400LLManager::lookup_device(*(uint8_t *)intf_ptr);

    DEBUG_TRACE("BMA400LL::i2c_read -> device.m_addr=%p, &reg_addr=%p", device.m_addr, &reg_addr);

    NrfI2C::write(device.m_bus, device.m_addr, &reg_addr, sizeof(reg_addr), true);
    DEBUG_TRACE("BMA400LL::i2c_read -> (uint8_t*)reg_data=%p, reg_data=%p", (uint8_t*)reg_data, reg_data);

	NrfI2C::read(device.m_bus, device.m_addr, (uint8_t*)reg_data, length);
    DEBUG_TRACE("BMA400LL::i2c_read %x : %x",reg_addr, reg_data);

    return BMA400_OK;
}

void BMA400LL::delay_us(uint32_t period, void *intf_ptr)
{
    PMU::delay_us(period);
}

double BMA400LL::convert_g_force(unsigned int g_scale, int16_t axis_value)
{
    double g_force = (double)g_scale * axis_value / 32768;

    return g_force;
	// return (double)g_scale * axis_value / 32768;
}

double BMA400LL::lsb_to_ms2(int16_t accel_data, uint8_t g_range, uint8_t bit_width)
{
    const float gravity_earth = 9.80665f;
    double accel_ms2 = 0;
    int16_t half_scale = 0;

    half_scale = 1 << (bit_width - 1);
    accel_ms2 = (gravity_earth * accel_data * g_range) / half_scale;

    return accel_ms2;
}

void BMA400LL::bma400_check_rslt(const char api_name[], int8_t rslt)
{
    switch (rslt)
    {
        case BMA400_OK:
            /* Do nothing */
            DEBUG_TRACE("BMA400 [%s]",api_name);
            break;
        case BMA400_E_NULL_PTR:
            DEBUG_ERROR("BMA400 Error [%d] : Null pointer\r\n", rslt);
            throw ErrorCode::I2C_COMMS_ERROR;
            break;
        case BMA400_E_COM_FAIL:
            DEBUG_ERROR("BMA400 Error [%d] : Communication failure\r\n", rslt);
            throw ErrorCode::I2C_COMMS_ERROR;
            break;
        case BMA400_E_INVALID_CONFIG:
            DEBUG_ERROR("BMA400 Error [%d] : Invalid configuration\r\n", rslt);
            throw ErrorCode::I2C_COMMS_ERROR;
            break;
        case BMA400_E_DEV_NOT_FOUND:
            DEBUG_ERROR("BMA400 Error [%d] : Device not found\r\n", rslt);
            throw ErrorCode::I2C_COMMS_ERROR;
            break;
        default:
            DEBUG_ERROR("BMA400 Error [%d] : Unknown error code\r\n", rslt);
            throw ErrorCode::I2C_COMMS_ERROR;
            break;
    }
}

void BMA400LL::read_xyz(double& x, double& y, double& z)
{
    int8_t rslt = 0;
    uint8_t power_mode = 0;
    // Turn accelerometer on so AXL is updated
    DEBUG_INFO("Entering in BMA400LL::read_xyz");

    rslt = bma400_get_power_mode(&power_mode, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_get_power_mode), rslt);
    DEBUG_TRACE("%s::POWER MODE == <%s>", GET_API_NAME(BMA400::read), getPowerModeName(static_cast<int>(power_mode)));

    struct bma400_sensor_conf conf[2];

    rslt = bma400_get_sensor_conf(conf, 2, &m_bma400_dev);

    // conf->type.
    DEBUG_INFO("0type %s = %x", GET_VAR_NAME(conf.type), conf[0].type);
    DEBUG_INFO("1type %s = %x", GET_VAR_NAME(conf.type), conf[0].type);
    DEBUG_INFO("0conf %s = %x", GET_VAR_NAME(conf[0].param.accel.odr), conf[0].param.accel.odr);
    DEBUG_INFO("1conf %s = %x", GET_VAR_NAME(conf[1].param.accel.odr), conf[1].param.accel.odr);
    DEBUG_INFO("0bm %s = %x", GET_VAR_NAME(m_bma400_sensor_conf[0].param.accel.odr), m_bma400_sensor_conf[0].param.accel.odr);
    DEBUG_INFO("1bm %s = %x", GET_VAR_NAME(m_bma400_sensor_conf[1].param.accel.odr), m_bma400_sensor_conf[1].param.accel.odr);
    DEBUG_INFO("0bm %s = %x", GET_VAR_NAME(m_bma400_sensor_conf[1].param.accel.range), m_bma400_sensor_conf[1].param.accel.range);
    // DEBUG_INFO("%s = %x", GET_VAR_NAME(conf.param.accel.range), conf.param.accel.range);
    // conf.param.accel.range = std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force));
    DEBUG_TRACE("m_g_force ______________ m_g_force = %s___________",  std::get<const char *>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_STR, m_g_force)));
    DEBUG_TRACE("m_g_force ______________ m_g_force = %s___________",  std::get<const char *>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_STR, static_cast<unsigned int>(m_bma400_sensor_conf[1].param.accel.range))));
    DEBUG_TRACE("m_g_force ______________ m_g_force = %s___________",  std::get<const char *>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_STR, static_cast<unsigned int>(conf[1].param.accel.range))));

    // Wait 50ms for reading (4 averaged samples, @ 100 Hz)
    PMU::delay_ms(50);

    // Read and convert accelerometer values
    union __attribute__((packed)) {
        uint8_t buffer[6] = {0};
        struct {
        	int16_t x;
        	int16_t y;
        	int16_t z;
        };
    } data;
    rslt = bma400_get_regs(BMA400_REG_ACCEL_DATA, data.buffer, sizeof(data.buffer), &m_bma400_dev);
    bma400_check_rslt("bma400_get_regs", rslt);

    // Convert to double precision G-force result on each axis
    // x = convert_g_force(m_g_force, data.x);
    // y = convert_g_force(m_g_force, data.y);
    // z = convert_g_force(m_g_force, data.z);

    x = (lsb_to_ms2(data.x, m_g_force, 12) - m_x);
    y = (lsb_to_ms2(data.y, m_g_force, 12) - m_y);
    z = (lsb_to_ms2(data.z, m_g_force, 12) - m_z);


    DEBUG_TRACE("BMA400LL::read_xyz: xyz=%f,%f,%f", x, y, z);
    DEBUG_INFO("   ---   X <%f> X   ---   ", x);
    DEBUG_INFO("   ---   Y <%f> Y   ---   ", y);
    DEBUG_INFO("   ---   Z <%f> Z   ---   ", z);
}

//Untodo: this is where I should read 128 samples at 20Hz so -> PMU:delay_ms()
void BMA400LL::read_xyz_128_at_20hz(double& x, double& y, double& z)
{
    int8_t rslt = 0;

