SizzleUnrlsd/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/bma400/bma400.cpp
    // Buffer pour accumuler les données
    double accumulated_x = 0, accumulated_y = 0, accumulated_z = 0;

    // Lire 128 échantillons à une fréquence de 20 Hz
    for (int i = 0; i < 1000; ++i) {
        // Wait for the next sample at 20 Hz (50 ms interval)
        PMU::delay_ms(10);

        // Lire et convertir les valeurs de l'accéléromètre
        union __attribute__((packed)) {
            uint8_t buffer[6];
            struct {
                int16_t x;
                int16_t y;
                int16_t z;
            };
        } data;

        rslt = bma400_get_regs(BMA400_REG_ACCEL_DATA, data.buffer, sizeof(data.buffer), &m_bma400_dev);
        bma400_check_rslt(GET_API_NAME(BMA400LL::read_xyz_128_at_20hz), rslt);

        // Convertir en G-force et accumuler
        // accumulated_x += convert_g_force(m_g_force, data.x);
        // accumulated_y += convert_g_force(m_g_force, data.y);
        // accumulated_z += convert_g_force(m_g_force, data.z);

        accumulated_x += data.x;
        accumulated_y += data.y;
        accumulated_z += data.z;
    }

    // Calculer la moyenne des 128 échantillons
    x = accumulated_x / 128;
    y = accumulated_y / 128;
    z = accumulated_z / 128;

    DEBUG_TRACE("BMA400LL::read_xyz: avg_xyz=%f,%f,%f", x, y, z);
}

double BMA400LL::read_temperature()
{
    int8_t rslt = 0;

    // Wait 10ms +/-12% for temperature reading
    PMU::delay_us(11200);

    // Read temperature
    int16_t temperature_data;
    bma400_get_temperature_data(&temperature_data, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(BMA400LL::read_temperature), rslt);

    // temperature_data = 195 ---> 19,5 degrees Celsius.

    DEBUG_TRACE("%s = %ld", GET_API_NAME(BMA400LL::read_temperature), temperature_data);
    return temperature_data;
}

void BMA400LL::set_wakeup_threshold(double thresh) noexcept
{
	m_wakeup_threshold = thresh;
}

void BMA400LL::set_wakeup_duration(double duration) noexcept
{
	m_wakeup_duration = duration;
}

void BMA400LL::set_wakeup_gforce(unsigned int g_force) noexcept
{
	m_g_force = static_cast<uint8_t>(g_force);
}

void BMA400LL::set_power_mode(unsigned int power_mode) noexcept
{
    // assert(power_mode <= UINT8_MAX && "Power mode value out of range for uint8_t"); assert_param ?
    m_power_mode = static_cast<uint8_t>(power_mode);
}

void BMA400LL::set_x_calibration(double x) noexcept
{
    m_x = x;
}

void BMA400LL::set_y_calibration(double y) noexcept
{
    m_y = y;
}

void BMA400LL::set_z_calibration(double z) noexcept
{
    m_z = z;
}

double BMA400LL::get_x_calibration(void) const noexcept
{
    return m_x;
};

double BMA400LL::get_y_calibration(void) const noexcept
{
    return m_y;
};

double BMA400LL::get_z_calibration(void) const noexcept
{
    return m_z;
};

uint8_t BMA400LL::get_power_mode(void) const noexcept
{
    return m_power_mode;
};

uint8_t BMA400LL::get_gforce(void) const noexcept
{
    return m_g_force;
};

static uint8_t calculateThreshold(float threshold_g, uint8_t acc_range)
{
    // Calcul du LSB en fonction de la plage de mesure
    float lsb = static_cast<float>(1 << (2 + acc_range)) / 4096.0f;
    DEBUG_TRACE("lbs=%f", (double)(lsb));
    // Conversion du seuil en "g" en valeur brute
    uint16_t threshold_raw = static_cast<uint16_t>(threshold_g / lsb);

    // Limite à 255 (8 bits max pour le registre)
    return static_cast<uint8_t>(std::min<uint16_t>(255, threshold_raw));
}

void BMA400LL::disable_wakeup()
{
    int8_t rslt;

	// Disable IRQ
	m_irq.disable();
	rslt = bma400_set_power_mode(BMA400_MODE_SLEEP, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_power_mode), rslt);

	// Disable Generic interrupt 1
	m_bma400_int_en.type = BMA400_GEN1_INT_EN;
	m_bma400_int_en.conf = BMA400_DISABLE;
	rslt = bma400_enable_interrupt(&m_bma400_int_en, 1, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_enable_interrupt), rslt);
    DEBUG_INFO("%s", GET_API_NAME(disable_wakeup));
	m_irq.disable();
}

bool BMA400LL::check_and_clear_wakeup()
{
	InterruptLock lock;
	bool value = m_irq_pending;

	m_irq_pending = false;
	return value;
}

/* Sleep mode */
void BMA400LL::setup_sleep_mode(void)
{
    int8_t rslt = 0;
    uint8_t power_mode = 0;

    rslt = bma400_set_power_mode(BMA400_MODE_SLEEP, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_power_mode), rslt);

    rslt = bma400_get_power_mode(&power_mode, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_get_power_mode), rslt);
    DEBUG_TRACE("%s::POWER MODE == <%s>", __FUNCTION__, getPowerModeName(static_cast<int>(power_mode)));
}

/* Low-power mode */

void BMA400LL::setup_lp_conf(void)
{
    DEBUG_INFO("Entering into %s", GET_API_NAME(BMA400::setup_lp_conf));

    int8_t rslt = 0;
    uint8_t power_mode = 0;

    rslt = bma400_set_power_mode(BMA400_MODE_LOW_POWER, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_power_mode), rslt);

    rslt = bma400_get_power_mode(&power_mode, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_get_power_mode), rslt);
    DEBUG_TRACE("%s::POWER MODE == <%s>", __FUNCTION__, getPowerModeName(static_cast<int>(power_mode)));

    // m_bma400_sensor_conf[static_cast<int>(BMA400MODE::LOW_POWER)].type                 = BMA400_ACCEL;
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::LOW_POWER)].type                 = BMA400_ACCEL;
    // acc_filt1 has data rate between 12.5Hz and 800Hz
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.accel.data_src = BMA400_DATA_SRC_ACCEL_FILT_1;
    // if the bma400 is in low-power mode, data conversion is fixed at 25Hz.
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.accel.odr      = BMA400_ODR_25HZ;
    // Must be generic TODO : get the value on the config file (pylinkit)
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.accel.range    = std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force));
    DEBUG_TRACE("m_g_force ______________ m_g_force = %d___________",  std::get<unsigned int>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_ENUM, m_g_force)));
    DEBUG_TRACE("m_g_force ______________ m_g_force = %s___________",  std::get<const char *>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_STR, m_g_force)));
    DEBUG_TRACE("m_g_force ______________ m_g_force = 0x%x___________",  std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force)));
    DEBUG_TRACE("m_wakeup_threshold ______________ m_wakeup_threshold = %f___________",  m_wakeup_threshold);
    DEBUG_TRACE("%s ______________ threshold = %d___________", GET_API_NAME(calculateThreshold), calculateThreshold(m_wakeup_threshold, std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force))));

