SizzleUnrlsd/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/bma400/bma400.cpp
    // Current consumption between ranges 800 nA and 1200 nA
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.accel.osr_lp   = BMA400_ACCEL_OSR_SETTING_0;

    // accel.fil1_bw = 0.48 * ODR or 0.24 * ODR
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.accel.filt1_bw = static_cast<uint8_t>(0.24 * 12.5);
    DEBUG_TRACE("m_bma400_sensor_conf.param.accel.filt1_bw=%d", static_cast<uint8_t>(0.24 * 12.5));

    /* Set the desired configurations to the sensor */
    rslt = bma400_set_sensor_conf(m_bma400_sensor_conf, 1, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_sensor_conf), rslt);

    return;
}

void BMA400LL::enable_wakeup_lp_mode(std::function<void()> func)
{
    int8_t rslt = 0;
    uint8_t power_mode = 0;

    rslt = bma400_get_power_mode(&power_mode, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_get_power_mode), rslt);
    DEBUG_INFO("BMA400LL:%s::POWER_MODE == <%s>", __FUNCTION__, getPowerModeName((int)(power_mode)));
    DEBUG_INFO("BMA400LL:%s::calculateThreshold == <%d>", __FUNCTION__, calculateThreshold(m_wakeup_threshold, std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force))));
    DEBUG_INFO("BMA400LL:%s::m_wakeup_threshold == <%d>", __FUNCTION__, m_wakeup_threshold);
    DEBUG_INFO("BMA400LL:%s::m_g_force == <%d>", __FUNCTION__, m_g_force);
    struct bma400_device_conf dev_setting[2];

    /* Selecting auto wakeup on wakeup interrupt event */
    dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].type   = BMA400_AUTOWAKEUP_INT;

    /* Get the previously set settings */
	rslt = bma400_get_device_conf(dev_setting, 1, &m_bma400_dev);
    if (rslt == BMA400_OK) {
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.wakeup_axes_en        = BMA400_AXIS_XYZ_EN;
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.wakeup_ref_update     = BMA400_UPDATE_EVERY_TIME;
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.sample_count          = BMA400_SAMPLE_COUNT_4;
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_threshold    = calculateThreshold(m_wakeup_threshold, std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force)));
		// dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_threshold    = 3;
		/* dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_ref_x		= 0 */
		/* dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_ref_y		= 0 */
		/* dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_ref_z		= 32 (0, 0, 1g) */
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_chan              = BMA400_MAP_BOTH_INT_PINS;
    
		rslt = bma400_set_device_conf(dev_setting, 1, &m_bma400_dev);
        if (rslt == BMA400_OK) {
			/* Enable the Generic interrupts in the sensor */
			m_bma400_int_en.type 	= BMA400_GEN1_INT_EN;
			m_bma400_int_en.conf 	= BMA400_ENABLE;
			rslt = bma400_enable_interrupt(&m_bma400_int_en, 1, &m_bma400_dev);
        }
    }

    m_irq.enable([this, func]() {
        if (!m_irq_pending) {
            m_irq_pending = true;
            func();
        }
    });
}

/* Normal mode */

void BMA400LL::setup_normal_conf(void)
{
    DEBUG_INFO("Entering into %s", GET_API_NAME(BMA400::setup_normal_conf));
    int8_t rslt = 0;
    uint8_t power_mode = 0;


    DEBUG_INFO("%s -> %d", GET_API_NAME(m_x), m_x);
    DEBUG_INFO("%s -> %d", GET_API_NAME(m_y), m_y);
    DEBUG_INFO("%s -> %d", GET_API_NAME(m_z), m_z);

    rslt = bma400_set_power_mode(BMA400_MODE_NORMAL, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_power_mode), rslt);

    rslt = bma400_get_power_mode(&power_mode, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_get_power_mode), rslt);
    DEBUG_TRACE("BMA400LL::setup_normal_conf::POWER MODE == <%s>", getPowerModeName((int)(power_mode)));

    /* Get the accelerometer configurations which are set in the sensor */
    rslt = bma400_get_sensor_conf(m_bma400_sensor_conf, 1, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_get_sensor_conf), rslt);

    /* Modify the desired configurations as per macros - available in bma400_defs.h file */
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].type                 = BMA400_ACCEL;
    /* m_bma400_sensor_conf[1].param.accel.odr      = BMA400_ODR_100HZ; */
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.accel.odr      = BMA400_ODR_400HZ;
    /* Must be generic TODO : get the value on the config file (pylinkit) */
    // m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.accel.range    = std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force));
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.accel.range    = BMA400_RANGE_4G;
    DEBUG_TRACE("m_g_force ______________ m_g_force = %d___________",  std::get<unsigned int>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_ENUM, m_g_force)));
    DEBUG_TRACE("m_g_force ______________ m_g_force = %s___________",  std::get<const char *>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_STR, m_g_force)));
    DEBUG_TRACE("m_g_force ______________ m_g_force = 0x%x___________",  std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force)));
    DEBUG_TRACE("m_wakeup_threshold ______________ m_wakeup_threshold = %f___________",  m_wakeup_threshold);
    DEBUG_TRACE("%s ______________ threshold = %d___________", GET_API_NAME(calculateThreshold), calculateThreshold(m_wakeup_threshold, std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force))));
    
    // m_bma400_sensor_conf[1].param.accel.data_src = BMA400_DATA_SRC_ACCEL_FILT_2;
    /* acc_filt1 has data rate between 12.5Hz and 800Hz */
    m_bma400_sensor_conf[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.accel.data_src = BMA400_DATA_SRC_ACCEL_FILT_1;

    // m_bma400_sensor_conf[1].param.accel.osr

    // m_bma400_sensor_conf[1].param.accel.osr_lp

    /* Set the desired configurations to the sensor */
    rslt = bma400_set_sensor_conf(m_bma400_sensor_conf, 2, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_sensor_conf), rslt);

