SizzleUnrlsd/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/bma400/bma400.cpp
    struct bma400_sensor_conf conf[2];

    rslt = bma400_get_sensor_conf(conf, 2, &m_bma400_dev);

    DEBUG_WARN("0type %s = %x", GET_VAR_NAME(conf[1].type), conf[1].type);
    conf[1].type = BMA400_ACCEL;
    rslt = bma400_set_sensor_conf(conf, 2, &m_bma400_dev);
    bma400_check_rslt("bma400_set_sensor_conf", rslt);
    rslt = bma400_get_sensor_conf(conf, 2, &m_bma400_dev);
    DEBUG_WARN("1type %s = %x", GET_VAR_NAME(conf[1].type), conf[1].type);
    DEBUG_WARN("0conf %s = %x", GET_VAR_NAME(conf[1].param.accel.odr), conf[1].param.accel.odr);
    DEBUG_WARN("0conf %s = %x", GET_VAR_NAME(conf[1].param.accel.range), conf[1].param.accel.range);
    DEBUG_WARN("0conf %s = %x", GET_VAR_NAME(m_bma400_sensor_conf[1].param.accel.range), m_bma400_sensor_conf[1].param.accel.range);
    DEBUG_WARN("acc1_range %s = %s", GET_VAR_NAME(m_bma400_sensor_conf[1].param.accel.range), std::get<const char *>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_STR, 0x1)));
    DEBUG_TRACE("m_g_force ______________ m_g_force = %s___________",  std::get<const char *>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_STR, static_cast<unsigned int>(m_bma400_sensor_conf[1].param.accel.range))));
    DEBUG_TRACE("m_g_force ______________ m_g_force = %s___________",  std::get<const char *>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_STR, static_cast<unsigned int>(conf[1].param.accel.range))));


    PMU::delay_ms(2000);

    // // note: Sleep mode: Registers readable and writable, no sensortime
    // rslt = bma400_set_power_mode(BMA400_MODE_SLEEP, &m_bma400_dev); 
    // bma400_check_rslt("bma400_set_power_mode: sleep", rslt);

    // m_bma400_device_conf.type                    = BMA400_INT_PIN_CONF;
    // m_bma400_device_conf.type                    = BMA400_AUTOWAKEUP_INT;

    // m_bma400_device_conf.param.int_conf.int_chan = BMA400_INT_CHANNEL_1;
    // m_bma400_device_conf.param.int_conf.pin_conf = BMA400_INT_PUSH_PULL_ACTIVE_0;
    // rslt = bma400_set_device_conf(&m_bma400_device_conf, BMA400_INT_PIN_CONF, &m_bma400_dev);
    // bma400_check_rslt("bma400_set_device_conf", rslt);

    return;
}

void BMA400LL::enable_wakeup_normal_mode(std::function<void()> func)
{
    DEBUG_INFO("BMA400LL::%s", __FUNCTION__);
    int8_t rslt;
    uint8_t power_mode = 0;

    rslt = bma400_get_power_mode(&power_mode, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_get_power_mode), rslt);
    DEBUG_INFO("BMA400LL:%s::POWER_MODE == <%s>", __FUNCTION__, getPowerModeName((int)(power_mode)));
    DEBUG_INFO("BMA400LL:%s::calculateThreshold == <%d>", __FUNCTION__, calculateThreshold(m_wakeup_threshold, std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force))));
    DEBUG_INFO("BMA400LL:%s::calculateThreshold == <%d>", __FUNCTION__, calculateThreshold(m_wakeup_threshold, std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force))));
    DEBUG_INFO("BMA400LL:%s::m_wakeup_threshold == <%d>", __FUNCTION__, m_wakeup_threshold);
    DEBUG_INFO("BMA400LL:%s::m_g_force == <%d>", __FUNCTION__, m_g_force);

    // .gen_int_thres = anymotion_thr,

    m_bma400_sensor_conf[1].type = BMA400_GEN1_INT;
    m_bma400_sensor_conf[1].param.gen_int = {
        .gen_int_thres = calculateThreshold(m_wakeup_threshold, std::get<uint8_t>(BMA_ACC::getAccelerometerRange(BMA_ACC::ParameterType::TO_UINT, m_g_force))),  // Adjust sensitivity
        // .gen_int_thres = 12,  // Adjust sensitivity
        .gen_int_dur = (uint8_t)(m_wakeup_duration - 1),    // Minimum duration for interrupt
        .axes_sel = BMA400_AXIS_XYZ_EN,
        .data_src = BMA400_DATA_SRC_ACC_FILT2,
        .criterion_sel = BMA400_ACTIVITY_INT,
        .evaluate_axes = BMA400_ANY_AXES_INT,
        .ref_update = BMA400_UPDATE_EVERY_TIME,
        .hysteresis = BMA400_HYST_96_MG,
        .int_thres_ref_x = 0, // not used
        .int_thres_ref_y = 0, // not used
        .int_thres_ref_z = 32, // not used
        .int_chan = BMA400_INT_CHANNEL_1
    };

    rslt = bma400_set_sensor_conf(m_bma400_sensor_conf, 2, &m_bma400_dev);
    bma400_check_rslt("bma400_set_sensor_conf: GEN1 interrupt", rslt);

    m_bma400_int_en.type = BMA400_GEN1_INT_EN;
    m_bma400_int_en.conf = BMA400_ENABLE;

    rslt = bma400_enable_interrupt(&m_bma400_int_en, 1, &m_bma400_dev);
    bma400_check_rslt("bma400_enable_interrupt: GEN1", rslt);

    m_irq.enable([this, func]() {
        if (!m_irq_pending) {
            m_irq_pending = true;
            func();
        }
    });
}

/* Auto low-power mode */

void BMA400LL::setup_autowakeup_autolowpower_conf(void)
{
    int8_t rslt = 0;
    uint8_t power_mode = 0;

    struct bma400_device_conf dev_setting[2];
    struct bma400_int_enable int_en;

    rslt = bma400_set_power_mode(BMA400_MODE_LOW_POWER, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_set_power_mode), rslt);

    rslt = bma400_get_power_mode(&power_mode, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_get_power_mode), rslt);
    DEBUG_TRACE("%s::POWER MODE == <%s>", __FUNCTION__, getPowerModeName(static_cast<int>(power_mode)));

    // set_auto_low_power ???


    /* Selecting auto wakeup on wakeup interrupt event */
    dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].type   = BMA400_AUTOWAKEUP_INT;

	/* Selecting auto low power mode*/
	dev_setting[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].type = BMA400_AUTO_LOW_POWER;

    /* Get the previously set settings */
	rslt = bma400_get_device_conf(dev_setting, 2, &m_bma400_dev);
	if (rslt == BMA400_OK) {
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.wakeup_axes_en 		= BMA400_AXIS_XYZ_EN;
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.wakeup_ref_update 		= BMA400_UPDATE_EVERY_TIME;
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.sample_count 		= BMA400_SAMPLE_COUNT_4;
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_threshold 		= 3;
		/* dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_ref_x		= 0 */
		/* dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_ref_y		= 0 */
		/* dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_wkup_ref_z		= 32 (0, 0, 1g) */
		dev_setting[static_cast<int>(BMA400POWERMODE::LOW_POWER)].param.wakeup.int_chan			= BMA400_INT_CHANNEL_1;
		
		/* Enable auto low power on Gen1 trigger  */
		dev_setting[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].param.auto_lp.auto_low_power_trigger 	= BMA400_AUTO_LP_GEN1_TRIGGER;

		/* Set the configurations in sensor */
		rslt = bma400_set_device_conf(dev_setting, 2, &m_bma400_dev);

		if (rslt == BMA400_OK) {
		
			/* Enable the Generic interrupts in the sensor */
			int_en.type 	= BMA400_AUTO_WAKEUP_EN;
			int_en.conf 	= BMA400_ENABLE;
			
			rslt = bma400_enable_interrupt(&int_en, 1, &m_bma400_dev);

		/* The sensor toggles between Low-power mode and Normal mode if tilt the device(sensor) 
		 * or place it back to flat 
		 * this can be verfied by reading the power mode and printing it continuously as follows
		 *	while (1) {
		 *		rslt = bma400_get_power_mode(&power_mode, dev);
		 *		printf("\n POWER MODE : %d",power_mode);
		 *	}
		 * The power mode toggling can be seen from the printed console output
		 */
	    }
    }
    return;
}

void BMA400LL::enable_wakeup_auto_mode(std::function<void()> func)
{
	int8_t rslt = 0;
	uint8_t power_mode = 0;
	/* Variable to store interrupt status */
	uint16_t int_status __attribute__((unused));
	/* Sensor configuration structure */
	// struct bma400_setting accel_settin[2];
	/* Interrupt configuration structure */
	// struct interrupt_enable int_en[2];

    struct bma400_sensor_conf accel_settin[2];
    struct bma400_int_enable int_en[2];;

	/* Select the GEN1 and GEN2 interrupts for configuration */
	accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)].type = BMA400_GEN1_INT;
	accel_settin[static_cast<int>(BMA400POWERMODE::MODE_NORMAL)].type = BMA400_GEN2_INT;

    rslt = bma400_get_power_mode(&power_mode, &m_bma400_dev);
    bma400_check_rslt(GET_API_NAME(bma400_get_power_mode), rslt);
    DEBUG_INFO("BMA400LL:%s::POWER_MODE == <%s>", __FUNCTION__, getPowerModeName((int)(power_mode)));
    

	/* Get the configurations set in the sensor */
	rslt = bma400_get_sensor_conf(&accel_settin[static_cast<int>(BMA400POWERMODE::LOW_POWER)], 2, &m_bma400_dev);

