SizzleUnrlsd/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/bma400/bma400.cpp
            if (auto it = calibration_power_mode_map.find(current_power_mode); it != calibration_power_mode_map.end())
                it->second();
            else
                throw ErrorCode::KEY_DOES_NOT_EXIST;
        }},
        {CalibrationWriteParameter::X, [this, value, offset]() {
            DEBUG_TRACE("%s: X_value=%f offset=%u", GET_API_NAME(BMA400::calibration_write), value, offset);
            m_bma400.set_x_calibration(value);
        }},
        {CalibrationWriteParameter::Y, [this, value, offset]() {
            DEBUG_TRACE("%s: Y_value=%f offset=%u", GET_API_NAME(BMA400::calibration_write), value, offset);
            m_bma400.set_y_calibration(value);
        }},
        {CalibrationWriteParameter::Z, [this, value, offset]() {
            DEBUG_TRACE("%s: Z_value=%f offset=%u", GET_API_NAME(BMA400::calibration_write), value, offset);
            m_bma400.set_z_calibration(value);
        }},
    };

    if (calibration_write_map.contains(static_cast<CalibrationWriteParameter>(offset)))
    {
        calibration_write_map.at(static_cast<CalibrationWriteParameter>(offset))();
    } else {
        DEBUG_TRACE("AXL::calibration_write: Invalid offset (%u)", offset);
    }
}

void BMA400LL::calibrate_offset(const uint8_t g_range, double& offset_x, double& offset_y, double& offset_z)
{
    int8_t rslt = 0;
    // Nombre d'échantillons à collecter pour la calibration
    const uint8_t n_samples = 200;
    // Buffers pour accumuler les données
    double accumulated_x = 0, accumulated_y = 0, accumulated_z = 0;

    // Lire plusieurs échantillons pour calculer l'offset
    for (uint8_t i = 0; i < n_samples; ++i) {
        PMU::delay_ms(10);

        union __attribute__((packed)) {
            uint8_t buffer[6];
            struct {
                int16_t x;
                int16_t y;
                int16_t z;
            };
        } data;

        rslt = bma400_get_regs(BMA400_REG_ACCEL_DATA, data.buffer, sizeof(data.buffer), &m_bma400_dev);
        bma400_check_rslt("BMA400LL::calibrate_offset() bma400_get_regs", rslt);

        accumulated_x += lsb_to_ms2(data.x, g_range, 12);
        accumulated_y += lsb_to_ms2(data.y, g_range, 12);
        accumulated_z += lsb_to_ms2(data.z, g_range, 12);
    }

    offset_x = accumulated_x / n_samples;
    offset_y = accumulated_y / n_samples;
    offset_z = accumulated_z / n_samples;

    DEBUG_TRACE("BMA400LL::calibrate_offset: Offset values: x=%f, y=%f, z=%f", offset_x, offset_y, offset_z);
}

void BMA400::calibration_read(double &value, unsigned int offset)
{
    double offset_x = 0.0;
    double offset_y = 0.0;
    double offset_z = 0.0;

    // DEBUG_INFO("Entering into %s", GET_API_NAME(BMA400::calibration_read));
    // DEBUG_INFO("%s::power_mode=%d", GET_API_NAME(BMA400::calibration_read), m_bma400.get_power_mode());
    // DEBUG_INFO("%s::g_force=%d", GET_API_NAME(BMA400::calibration_read), m_bma400.get_gforce());

    calibration_read_map = {
        {CalibrationAxis::X,    [this, &offset_x]() { DEBUG_TRACE("AXL::calibrate: read X"); return offset_x; }},
        {CalibrationAxis::Y,    [this, &offset_y]() { DEBUG_TRACE("AXL::calibrate: read Y"); return offset_y; }},
        {CalibrationAxis::Z,    [this, &offset_z]() { DEBUG_TRACE("AXL::calibrate: read Z"); return offset_z; }},
    };

    if (calibration_power_mode_map.contains(static_cast<CalibrationPowerMode>((m_bma400.get_power_mode()))))
    {
        calibration_power_mode_map.at(static_cast<CalibrationPowerMode>((m_bma400.get_power_mode())))();
        DEBUG_INFO("AXL::calibrate: Valid power mode (%u)", offset);
    } else {
        DEBUG_ERROR("AXL::calibrate: Invalid power mode (%u)", offset);
    }

    m_bma400.calibrate_offset(m_bma400.get_gforce(), offset_x, offset_y, offset_z);

    if (calibration_read_map.contains(static_cast<CalibrationAxis>(offset)))
    {
        value = calibration_read_map.at(static_cast<CalibrationAxis>(offset))();
        DEBUG_INFO("AXL::calibrate: Valid value (%f)", value);
    } else {
        DEBUG_ERROR("AXL::calibrate: Invalid offset (%u)", offset);
        value = 0.0;
    }
}

double BMA400::read(unsigned int offset)
{
	switch(offset)
    {
        case 0: /* temperature */
            return m_bma400.read_temperature();
        case 1: /* x */
            m_bma400.read_xyz(m_last_x, m_last_y, m_last_z);
            return m_last_x; 
        case 2: /* y */
            return m_last_y;
        case 3: /* z */
            return m_last_z;
        case 4: /* IRQ pending */
            return static_cast<double>(m_bma400.check_and_clear_wakeup());
        default:
            return 0.0;
	}
}

void BMA400::install_event_handler(unsigned int, std::function<void()> handler)
{
    m_bma400.enable_wakeup(handler);
};

void BMA400::remove_event_handler(unsigned int)
{
	m_bma400.disable_wakeup();
};
